Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/mems.tmx
Source language: ca
Languages: es_es

source: #x0151;+ és el caràcter ``{{T1}{ec}{m}{n}{'256}}'').
es_es: #x0151;+ es el carácter ``{{T1}{ec}{m}{n}{'256}}'').

source: $$ Cal comprovar que la fórmula anterior es compleix, tot i que siga a llarg termini, abans de triar una estratègia de traducció per a disseminació basada en la postedició.
es_es: $$ Hay que comprobar que la fórmula anterior se cumple, a pesar de que sea a largo plazo, antes de elegir una estrategia de traducción para diseminación basada en la postedición.

source: (*) Per exemple, si $L$ és l'espanyol, mots com { escondite} poden referir-se a un lloc on amagar-se (1) o a un joc (2) (en $L'$=català, amagatall (1) i fet, { amagar}, fet a amagar o conillets a amagar (2)).
es_es: () Por ejemplo, si $L$ es el español, palabras como { escondite} pueden referirse a un lugar donde esconderse (1) o a un juego (2) (en $El $=catalán, amagatall (1) y hecho, { esconder}, hecho de esconder o conillets a amagar (2)).

source: (*) Elegiu un idioma qualsevol que conegueu bé, $L$.
es_es: (*) Elegid un idioma cualquiera que conozcáis bien, $L$.

source: (si no sabeu calcular-ho en general, feu els càlculs amb un text de, per exemple, 1000 mots).
es_es: (si no sabéis calcularlo en general, haced los cálculos con un texto de, por ejemplo, 1000 palabras).

source: 240 120 9 Quan volem tenir els registres (les fitxes) d'una base de dades ordenada simultàniament per dos camps per a optimitzar les recerques construïm dos índexs.
es_es: 240 120 9 Cuando queremos tener los registros (las fichas) de una base de datos ordenada simultáneamente por dos campos para optimizar las investigaciones construimos dos índices.

source: } {Els 8 mòduls que formen la cadena de muntatge d'interNOSTRUM.}
es_es: } {Los 8 módulos que forman la cadena de montaje de interNOSTRUM.}

source: Depén; si els camps són numèrics no és necessari.
es_es: Depende; si los campos son numéricos no es necesario.

source: Joan usa el Web Translator mentre navega per les pàgines d'Internet de la Universität Mainz per a saber quina assignatura dóna el professor Karl-Hans Lehninger i quins són els seus interessos investigadors.
es_es: Joan usa el Web Translator mientras navega por las páginas de Internet de la Universität Mainz para saber qué asignatura da el profesor Karl-Hans Lehninger y cuáles son sus intereses investigadores.

source: No, perquè els llenguatges controlats s'han de dissenyar independentment dels sistemes de TA.
es_es: No, porque los lenguajes controlados se tienen que diseñar independientemente de los sistemas de TA.

source: Per a evitar construccions o frases difícils de traduir.
es_es: Para evitar construcciones o frases difíciles de traducir.

source: S'evita la necessitat que una persona interaccione amb el programa de traducció automàtica per a resoldre ambigüitats durant la traducció.
es_es: Se evita la necesidad de que una persona interaccione con el programa de traducción automática para resolver ambigüedades durante la traducción.

source: En què es diferencia un camp clau o camp índex de la resta dels camps d'una fitxa?{}
es_es: ¿En qué se diferencia un campo clave o campo índice del resto de los campos de una ficha?{}

source: Quan es duplica el nombre de fitxes d'una taula determinada d'una base de dades, què succeeix amb el nombre de consultes que realitza una recerca dicotòmica?
es_es: Cuando se duplica el número de fichas de una tabla determinada de una base de datos,¿qué sucede con el número de consultas que realiza una investigación dicotómica?

source: Quan usem un programa gestor de bases de dades terminològiques per a buscar un terme en una base de dades{}
es_es: Cuando usamos un programa gestor de bases de datos terminológicas para buscar un término en una base de datos{}

source: En els epígrafs successius d'aquesta secció es donen alguns detalls sobre com es pot usar la traducció automàtica en situacions similars a les esmentades.
es_es: En los epígrafes sucesivos de esta sección se dan algunos detalles sobre cómo se puede usar la traducción automática en situaciones similares a las mencionadas.

source: Quan no es detecta cap patró en la posició actual, es tradueix literalment un mot i es torna a iniciar el procés.
es_es: Cuando no se detecta ningún patrón en la posición actual, se traduce literalmente una palabra y se vuelve a iniciar el proceso.

source: [Anàlisi morfològica:] El subprograma d'anàlisi morfològica, que es genera automàticament a partir d'un diccionari morfològic de la llengua origen (LO), el qual conté els lemes, els paradigmes de flexió i les connexions entre ells.
es_es: [Análisis morfológico:] El subprograma de análisis morfológico, que se genera automáticamente a partir de un diccionario morfológico de la lengua origen (LO), el cual contiene los lemas, los paradigmas de flexión y las conexiones entre ellos.

source: Quan s'usen per a la traducció, els llenguatges controlats restringeixen directament{} {} la llengua meta.
es_es: Cuando se usan para la traducción, los lenguajes controlados restringen directamente{} {} la lengua meta.

source: Aquestes divergències s'han de tractar amb les regles gramaticals escaients.
es_es: Estas divergencias se tienen que tratar con las reglas gramaticales oportunas.

source: Quant als desavantatges, podem dir que: el disseny d'un llenguatge controlat no és gens trivial: cal estudiar amb profunditat corpus de textos pertanyents al domini i prendre decisions difícils; el poder d'expressió d'un llenguatge controlat és sempre més restringit; l'escriptura de textos en llenguatge controlat és més lenta; és necessària una inversió addicional de temps en l'aprenentatge del llenguatge controlat per part dels autors.
es_es: En cuanto a las desventajas, podemos decir que: el diseño de un lenguaje controlado no es nada trivial: hay que estudiar con profundidad corpus de textos pertenecientes al dominio y tomar decisiones difíciles; el poder de expresión de un lenguaje controlado es siempre más restringido; la escritura de textos en lenguaje controlado es más lenta; es necesaria una inversión adicional de tiempo en el aprendizaje del lenguaje controlado por parte de los autores.

source: Com es pot veure, els desenvolupaments tècnics fets al voltant del disseny d'un llenguatge controlat es relacionen amb molts conceptes que es tracten en aquest llibre.
es_es: Como se puede ver, los desarrollos técnicos hechos en torno al diseño de un lenguaje controlado se relacionan con muchos conceptos que se tratan en este libro.

source: Com ja s'ha discutit en el capítol , la divisió d'un text en mots presenta alguns aspectes no trivials; se n'esmenten dos: les locucions (o girs) i els pronoms enclítics.
es_es: Como ya se ha discutido en el capítulo , la división de un texto en palabras presenta algunos aspectos no triviales; se mencionan dos: las locuciones (o giros ) y los pronombres enclíticos.

source: Els dos últims desavantatges es poden reduir si es dota els autors d'eines informàtiques, com ara d'un editor de textos intel·ligent que els ajude a escriure en el llenguatge controlat.
es_es: Las dos últimas desventajas se pueden reducir si se dota a los autores de herramientas informáticas, como por ejemplo de un editor de textos inteligente que los ayude a escribir en el lenguaje controlado.

source: Busca, en la posició actual de la frase, el patró més llarg que concorda amb un patró del seu catàleg (per exemple, si en la posició actual es llegeix ``un senyal inequívoc'', tria { art}--{ nom}--{ adj} en comptes de { art}--{ nom}).
es_es: Busca, en la posición actual de la frase, el patrón más largo que concuerda con un patrón de su catálogo (por ejemplo, si en la posición actual se lee "una señal inequívoca'', elige { arte}--{ nombre}--{ adj} en vez de { arte }--{ nombre}).

source: Opera sobre aquest patró (propagació de gènere i nombre, reordenament, canvis lèxics) seguint les regles associades a ell.
es_es: Opera sobre este patrón (propagación de género y número, reordenamiento, cambios léxicos) siguiendo las reglas asociadas a él.

source: Continua immediatament darrere del patró tractat (no torna a visitar els mots sobre els quals ha operat).
es_es: Continúa inmediatamente detrás del patrón tratado (no vuelve a visitar las palabras sobre las cuales ha operado).

source: Altes o addicions: afegir un nou registre a la base de dades, tot fent que els seus camps prenguen els valors corresponents.
es_es: Altas o adiciones: añadir un nuevo registro a la base de datos, haciendo que sus campos tomen los valores correspondientes.

source: Disseminació.
es_es: Diseminación.

source: El sentit (entre els possibles sentits del terme) al qual es refereix la fitxa o registre actual.
es_es: El sentido (entre los posibles sentidos del término) al que se refiere la ficha o registro actual.

source: Emetre un missatge d'error el més informatiu possible quan detecta una violació de les especificacions del llenguatge.
es_es: Emitir un mensaje de error lo más informativo posible cuando detecta una violación de las especificaciones del lenguaje.

source: Es queda exactament com està.
es_es: Se queda exactamente como está.

source: Es refereixen al mateix terme.
es_es: Se refieren al mismo término.

source: Intel·ligibilitat de la traducció en brut.
es_es: Inteligibilidad de la traducción en bruto.

source: La manera d'emmagatzemar el camp és diferent (els camps índex o clau s'emmagatzemen de manera comprimida i els altres no).
es_es: La manera de almacenar el campo es diferente (los campos índice o clave se almacenan de manera comprimida y los otros no).

source: La traducció i el manteniment de tots els manuals tècnics d'una família de productes (per exemple, els manuals de manteniment d'una gamma d'automòbils).
es_es: La traducción y el mantenimiento de todos los manuales técnicos de una familia de productos (por ejemplo, los manuales de mantenimiento de una gama de automóviles).

source: No, perquè només estem mirant el text meta.
es_es: No, porque sólo estamos mirando el texto meta.

source: Només els números de les fitxes ordenats segons el valor del camp.
es_es: Sólo los números de las fichas ordenados según el valor del campo.

source: Sí, però és necessari duplicar totes les fitxes en memòria.
es_es: Sí, pero es necesario duplicar todas las fichas en la memoria.

source: {} hem de conéixer com s'escriu exactament el terme per a poder trobar-lo.
es_es: {} tenemos que conocer cómo se escribe exactamente el término para poder encontrarlo.

source: {} per a la disseminació.
es_es: {} para la diseminación.

source: {} traducció automàtica assistida per la persona.
es_es: {} traducción automática asistida por la persona.

source: {} només pot referir-se a la sintaxi.
es_es: {} sólo puede referirse a la sintaxis.

source: ... és una alternativa a la postedició, que elimina completament aquesta última fase.
es_es: ... es una alternativa a la postedición, que elimina completamente esta última fase.

source: Baixes o esborrats: eliminar un o més registres.
es_es: Bajas o borrados: eliminar uno o más registros.

source: {flamand83b}: traduir és representar amb precisió (fidelitat a l'autor) un missatge en LO en una forma autèntica i correcta de la LM, adaptada al contingut i al receptor (fidelitat al lector)''.
es_es: {flamand83b}: traducir es representar con precisión (fidelidad al autor) un mensaje en LO en una forma auténtica y correcta de la LM, adaptada al contenido y al receptor (fidelidad al lector)'.

source: Els textos meta resultants són molt més curts.
es_es: Los textos meta resultantes son mucho más cortos.

source: Es troben en el mateix índex.
es_es: Se encuentran en el mismo índice.

source: Joan usa el Web Translator per a fer una versió en alemany de la seua pàgina Web abans de publicar-la en Internet.
es_es: Joan usa el Web Translator para hacer una versión en alemán de su página Web antes de publicarla en Internet.

source: Joan usa el Web Translator per a fer una versió en alemany de la seua pàgina Web.
es_es: Joan usa el Web Translator para hacer una versión en alemán de su página Web.

source: L'autor de la fitxa (quan més d'una persona gestiona la base de dades).
es_es: El autor de la ficha (cuando más de una persona gestiona la base de datos).

source: La postedició sistemàtica Frans consulta a través d'Internet la base de dades terminològica Eurodicautom quan tradueix dossiers antiglobalització de l'anglés al neerlandés.
es_es: La postedición sistemática Frans consulta a través de Internet la base de datos terminológica Eurodicautom cuando traduce dossieres antiglobalización del inglés al neerlandés.

source: Les recerques de fitxes per aquest camp són molt més ràpides que les que es facen per camps que no són clau o índex.
es_es: Las búsquedas de fichas por este campo son mucho más rápidas que las que se hagan por campos que no son clave o índice.

source: No hi ha cap altre remei: cal duplicar la base de dades.
es_es: No hay ningún otro remedio: hay que duplicar la base de datos.

source: Perquè el format quede més agradable a la vista.
es_es: Para que el formato quede más agradable a la vista.

source: Postedició, ja que l'idioma del document canvia per què puga ser entés.
es_es: Postedición, puesto que el idioma del documento cambia para que pueda ser entendido.

source: Proposar a la persona usuària formes alternatives vàlides al text erroni.
es_es: Proponer a la persona usuaria formas alternativas válidas al texto erróneo.

source: S'incrementa en 1 com a promedi.
es_es: Se incrementa en 1 como promedio.

source: Sí, perquè en cada cas s'han d'evitar problemes diferents.
es_es: Sí, porque en cada caso se tienen que evitar problemas diferentes.

source: Sí, perquè són una font molt important d'errors especialment difícils de corregir si no es coneix què ha passat.
es_es: Sí, porque son una fuente muy importante de errores especialmente difíciles de corregir si no se conoce qué ha pasado.

source: Una còpia de les fitxes ordenades pel camp índex corresponent.
es_es: Una copia de las fichas ordenadas por el campo índice correspondiente.

source: Velocitat.
es_es: Velocidad.

source: {} per a l'assimilació.
es_es: {} para la asimilación.

source: {} traducció humana assistida per l'ordinador.
es_es: {} traducción humana asistida por el ordenador.

source: {} un sistema de traducció automàtica ergonòmic.
es_es: {} un sistema de traducción automática ergonómico.

source: {}sempre és necessari conéixer-ne la categoria lèxica i indicar-la al gestor
es_es: {}siempre es necesario conocer la categoría léxica e indicarla al gestor

source: {}la preedició repetitiva dels documents origen.
es_es: {}la preedición repetitiva de los documentos origen.

source: {} només pot referir-se a la terminologia.
es_es: {} sólo puede referirse a la terminología.

source: [Consulta del diccionari bilingüe] (transferència lèxica): El subprograma de consulta del diccionari bilingüe és invocat pel subprograma de tractament de patrons (vegeu més avall); es genera automàticament a partir d'un fitxer que conté les correspondències bilingües.
es_es: [Consulta del diccionario bilingüe] (transferencia léxica): El subprograma de consulta del diccionario bilingüe es invocado por el subprograma de tratamiento de patrones (véase más abajo); se genera automáticamente a partir de un fichero que contiene las correspondencias bilingües.

source: ... imposibilita l'ús del sistema per a tasques de disseminació d'informació.
es_es: ... imposibilita el uso del sistema para tareas de diseminación de información.

source: Modificacions: canviar el valor d'un o més camps d'un o més registres de la base de dades.
es_es: Modificaciones: cambiar el valor de uno o más campos de uno o más registros de la base de datos.

source: {jakobson66b}: ``Traducció és la interpretació de signes verbals per mitjà d'una altra llengua''.
es_es: {jakobson66b}: ``Traducción es la interpretación de signos verbales por medio de otra lengua''.

source: El personal d'IBM tradueix patents europees per a detectar possibles avanços en correcció d'errors de comunicacions digitals.
es_es: El personal de IBM traduce patentes europeas para detectar posibles avances en corrección de errores de comunicaciones digitales.

source: Els textos origen es fan més intel·ligibles.
es_es: Los textos origen se hacen más inteligibles.

source: L'empresa Into the Wind tradueix automàticament el seu catàleg de milotxes i catxerulos a diverses llengües.
es_es: La empresa Into the Wind traduce automáticamente su catálogo de cometas y cometas a varias lenguas.

source: La definició del terme en una o més llengües.
es_es: La definición del término en una o más lenguas.

source: No, perquè la llengua meta dels dos sistemes és la mateixa.
es_es: No, porque la lengua meta de los dos sistemas es la misma.

source: No; s'hi pot crear més d'un índex.
es_es: No; se puede crear más de uno índice.

source: Només per a certs idiomes amb estructura gramatical senzilla com l'anglés.
es_es: Sólo para ciertos idiomas con estructura gramatical sencilla como el inglés.

source: {}la traducció de fragments ja traduïts anteriorment.
es_es: {}la traducción de fragmentos ya traducidos anteriormente.

source: És una alternativa a la postedició.
es_es: Es una alternativa a la postedición.

source: [Generació morfològica:] El generador morfològic fa l'operació inversa a l'analitzador morfològic però amb formes de la LM i es genera automàticament a partir d'un diccionari morfològic de la LM.
es_es: [Generación morfológica:] El generador morfológico hace la operación inversa al analizador morfológico pero con formas de la LM y se genera automáticamente a partir de un diccionario morfológico de la LM.

source: El camp temàtic de la fitxa.
es_es: El campo temático de la ficha.

source: En el Diccionari de la Llengua Catalana es defineix { traducció} com la ``reproducció del contingut d'un text o d'un enunciat oral, formulat en una llengua, en formes pròpies d'una altra llengua'' (i traduir com ``escriure o dir en una llengua allò que ha estat escrit o dit en una altra'').
es_es: En el Diccionario de la Lengua Catalana se define { traducción} como la ``reproducción del contenido de un texto o de un enunciado oral, formulado en una lengua, en formas propias de otra lengua'' (i traducir como ``escribir o decir en una lengua aquello que ha sido escrito o dedo en otra'').

source: [Postgeneració:] Les formes superficials que estan implicades en processos d'apostrofació i guionatge (pronoms febles, articles, algunes preposicions, etc.) activen aquest subprograma, que normalment es troba inactiu.
es_es: [Postgeneración:] Las formas superficiales que están implicadas en procesos de apostrofación y guionado (pronombres débiles, artículos, algunas preposiciones, etc.) activan este subprograma, que normalmente se encuentra inactivo.

source: {alcaraz97b} defineixen traducció com ``expresión de un enunciado en la lengua de llegada [lengua meta] que sea equivalente al de la lengua de partida [lengua origen]''; queda per definir la noció d'equivalència, que els mateixos autors defineixen així: ``la posesión del mismo valor por parte de los enunciados de la lengua de partida y de la de llegada''; l'equivalència pot ser { semàntica}, estilística i textual.
es_es: {alcaraz97b} definen traducción como ``expresión de un enunciado en la lengua de llegada [lengua meta] que sea equivalente al de la lengua de partida [lengua origen]''; queda para definir la noción de equivalencia, que los mismos autores definen así: ``la posesión del mismo valor medio parte de los enunciados de la lengua de partida y de la de llegada''; la equivalencia puede ser { semántica}, estilística y textual.

source: Altres termes relacionats.
es_es: Otros términos relacionados.

source: {} la llengua origen.
es_es: {} la lengua origen.

source: Informació sobre la morfologia o la flexió del terme en cada una de les llengües.
es_es: Información sobre la morfología o la flexión del término en cada una de las lenguas.

source: {} tant la llengua origen com la llengua meta.
es_es: {} tanto la lengua origen como la lengua meta.

source: A més, també segueix les directrius de l'estàndar ISO 12620, que defineix un conjunt de camps, i els seus possibles valors, per a la informació terminològica.
es_es: Además, también sigue las directrices del estándar ISO 12620, que define un conjunto de campos, y sus posibles valores, para la información terminológica.

source: A tall d'exemple, considereu el següent text en tok pisin (el text està pres de {lyovin97b}): { Long taim bifo, wanpela ailan, draipela pik i save stap ya, na em i save kaikai ol man.
es_es: Como ejemplo, considerad el siguiente texto en tok pisin (el texto está tomado de {lyovin97b}): { Long taim bifo, wanpela ailan, draipela pik y save stap ya, na me y save kaikai ol man.

source: Abans de considerar l'automatització de la traducció fóra bo que ens paràrem un poc per a discutir què vol dir exactament el mot traducció.
es_es: Antes de considerar la automatización de la traducción, sería bueno que nos parásemos un poco para discutir qué quiere decir exactamente la palabra traducción.

source: Abans del cos (body), l'element arrel { martif} conté una capçalera (martifHeader) amb informació sobre l'origen de la base de dades.
es_es: Antes del cuerpo (body), el elemento raíz { martif} contiene una cabecera (martifHeader) con información sobre el origen de la base de datos.

source: Actualment, { interNOSTRUM} tradueix textos en formats ANSI, HTML i RTF de l'espanyol al català oriental i al revés (sobre formats, vegeu l'epígraf ) i permet la navegació traduïda per Internet (és a dir, permet la traducció instantània dels documents que es vagen visitant sense haver d'invocar explícitament el traductor).
es_es: Actualmente, { interNOSTRUM} traduce textos en formatos ANSI, HTML y RTF del español al catalán oriental y a la inversa (sobre formatos, véase el epígrafe ) y permite la navegación traducida por Internet (es decir, permite la traducción instantánea de los documentos que se vayan visitando sin tener que invocar explícitamente el traductor).

source: Ací són rellevants les nocions de MAHT (machine-aided human translation, traducció humana assistida per una màquina) i HAMT (human-aided machine translation, traducció automàtica assistida per un humà), que estableixen les dues situacions bàsiques d'interacció entre una persona i un ordinador a l'hora de fer la traducció.
es_es: Aquí son relevantes las nociones de MAHT (machine-aided human translation, traducción humana asistida por una máquina) y HAMT (human-aided machine translation, traducción automática asistida por un humano), que establecen las dos situaciones básicas de interacción entre una persona y un ordenador a la hora de hacer la traducción.

source: Afortunadament, en els darrers anys s'ha desenvolupat un conjunt de formats estàndards per facilitar aquest intercanvi; un dels més coneguts es TBX.} (per TermBase exchange, ``intercanvi de bases de dades terminològiques'').
es_es: Afortunadamente, en los últimos años se ha desarrollado un conjunto de formatos estándar para facilitar este intercambio; uno de los más conocidos es TBX.} (por TermBase exchange, ``intercambio de bases de datos terminológicas'').
